Revit 2024 API
BuiltInFailures.FamilyFailures.SketchCannotBeAutomaticallyDimensioned Property
 Sketch can't be Automatically Dimensioned - this is a prerequisite for Labeled Dimensions to work properly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchCannotBeAutomaticallyDimensioned { get; }
Visual Basic
Public Shared ReadOnly Property SketchCannotBeAutomaticallyDimensioned As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchCannotBeAutomaticallyDimensioned {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace